kwOgive/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.002;

boundaryField
{
  inlet
  {
      type            calculated;
      value           $internalField;
  }
  
  outlet
  {
      type            calculated;
      value           $internalField;
  }

  ogive
  {
      type            nutkWallFunction;
      value           $internalField;
  }
  base
  {
      type            nutkWallFunction;
      value           $internalField;
  }
    
  front
  {
      type            wedge;
  }
  
  back
  {
      type            wedge;
  }

}
